delivery_v2/tools/apache-benchmark/output/result.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking host.docker.internal (be patient)...INFO: GET header == 
---
GET /api/v1/transfer-requests?reference=TRA-543-318-5633-AA/ HTTP/1.0
Host: host.docker.internal:8095
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Tue, 29 Dec 2020 17:07:56 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
..done


Server Software:        
Server Hostname:        host.docker.internal
Server Port:            8095

Document Path:          /api/v1/transfer-requests?reference=TRA-543-318-5633-AA/
Document Length:        38 bytes

Concurrency Level:      1
Time taken for tests:   0.106 seconds
Complete requests:      20
Failed requests:        0
Total transferred:      4860 bytes
HTML transferred:       760 bytes
Requests per second:    188.99 [#/sec] (mean)
Time per request:       5.291 [ms] (mean)
Time per request:       5.291 [ms] (mean, across all concurrent requests)
Transfer rate:          44.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.3      0       2
Processing:     2    5   4.1      3      20
Waiting:        2    4   4.1      3      20
Total:          2    5   4.1      4      21
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      6
  80%      7
  90%     10
  95%     21
  98%     21
  99%     21
 100%     21 (longest request)